cask_args appdir: '/Applications'

tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "fullscreen/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Tools
brew 'ansible'
brew 'awscli'
brew 'bash'
brew 'bat'
brew "brew-cask-completion"
brew 'cmake'
brew 'cmatrix'
brew 'coreutils', link: true
brew 'curl'
brew 'deno'
brew 'docker'
brew 'fd'
brew 'ffmpeg'
brew 'flac'
brew 'findutils'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'gettext', link: true
brew 'git'
brew 'go'
brew 'glide'
brew 'gnupg'
brew 'gnutls'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'
brew 'helm'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'iperf'
brew 'ipython'
brew 'jq'
brew 'lazygit'
brew 'lynx'
brew 'mkvtoolnix', args: ['with-qt']
brew 'mono'
brew 'nmap'
brew 'nnn'
brew 'nvm'
brew 'openconnect'
brew 'openssl@1.1'
brew 'openvpn', restart_service: true
brew 'php@8.1', link: true
brew 'python@3.9', link: true
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vegeta'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Applications
cask 'adoptopenjdk8'
cask 'appcleaner'
cask 'Amethyst'
cask 'coconutbattery'
cask 'firefox'
cask 'filebot'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'iterm2'
cask 'keepassxc'
cask 'libreoffice'
cask 'little-snitch'
cask 'malwarebytes'
cask 'mediaelch'
cask 'nordvpn'
cask 'paragon-extfs'
cask 'sequel-ace'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'the_silver_searcher'
cask 'transmission'
cask 'transmit'
cask 'typora'
cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-inconsolata-g-for-powerline'
cask 'font-source-code-pro'
