#####################
# TAPS              #
#####################
tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"


#####################
# PACKAGES          #
#####################
# Tools
brew "ansible"
brew "automake"
brew "autopep8"
brew "awscli", link: true
brew "bash"
brew "bat"
brew "exa"
brew "fd"
brew "gh"
brew "htop"
brew "lazygit"
brew "less"
brew "lynx"
brew "nmap"
brew "nnn"
brew "node@18", link: true
brew "nvm"
brew "openvpn"
brew "perl"
brew "postgresql@14"
brew "pycodestyle"
brew "terraform"
brew "tmux"
brew "vim"
brew "zoxide"
brew "zsh"

# Utils
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gettext"
brew "git"
brew "git-delta"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "grep"
brew "jq"
brew "mariadb"
brew 'mas'
brew "nvm"
brew "openjdk"
brew "pipenv"
brew "rbenv"
brew "ruby-build"
brew "shellcheck"
brew "shfmt"
brew "the_silver_searcher"
brew "tree"
brew "typescript"
brew "watch"
brew "watchman"
brew "wget"
brew "xmlstarlet"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Containers and VMs
brew "docker", link: true
brew "helm"
brew "kubeconform"

# Media
brew "ffmpeg"
brew "flac"
brew "jpeg-xl"
brew "lame"

# Package Dependencies
brew "aom"
brew "berkeley-db", link: true
brew "boost"
brew "cairo"
brew "gdbm"
brew "glib"
brew "gnutls"
brew "groonga"
brew "guile"
brew "harfbuzz"
brew "isl"
brew "leptonica"
brew "libass"
brew "libyaml"
brew "little-cms2"
brew "nettle"
brew "openjpeg"
brew "openldap"
brew "p11-kit"
brew "qt"
brew "srt"
brew "tesseract"
brew "unbound"


#####################
# CASKS             #
#####################
# Applications
cask "amethyst"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-drive"
cask "notion"
cask "slack"
cask "spotify"
cask "transmit"

# Media
cask "filebot"
cask "handbrake"
cask "mkvtoolnix"
cask "vlc"

# Tech
cask "alacritty"
cask "android-studio"
cask "docker"
cask "iterm2"
cask "keepassxc"
cask "little-snitch"
cask "paragon-extfs"
cask "sequel-ace"
cask "spectacle"
cask "sublime-text"
cask "utm"

# Pre releases
cask "homebrew/cask-versions/virtualbox"
cask "homebrew/cask-versions/zulu11"

# Fonts
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"


#####################
# Mac App Store     #
#####################
mas "Xcode", id: 497799835
