cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap "homebrew/services"

# Tools
brew "ansible"
brew "awscli"
brew 'bash'
brew 'composer'
brew 'coreutils', link: true
brew 'docker'
brew 'docker-machine'
brew "ffmpeg"
brew 'flac'
brew 'git'
brew 'git-flow'
brew 'gettext', link: true
brew 'go'
brew "highlight"
brew 'htop'
brew 'iperf'
brew 'ipython'
brew 'kops'
brew 'lynx'
brew 'macvim'
brew 'mkvtoolnix', args: ['with-qt']
brew "nmap"
brew 'node'
brew 'nodeenv'
brew 'openvpn'
brew 'php7'
brew "shellcheck"
brew 'terraform'
brew 'tmux'
brew "tree"
brew 'watch'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew "zsh-syntax-highlighting"

# Applications
cask 'firefox'
cask 'filebot'
cask 'flux'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'handbrake'
cask 'iterm2'
cask 'java'
cask 'keepassxc'
cask 'libreoffice'
cask 'little-snitch'
cask 'malwarebytes'
cask 'mediaelch'
cask 'minikube'
cask 'nordvpn'
cask 'paragon-extfs'
cask 'postman'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'
cask 'wine-stable'

# Fonts
cask 'font-inconsolata-g-for-powerline'
cask "font-source-code-pro"
